#### Terraform Validation & Plan Results
* Terraform Version 📎`1.13.4`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.communication_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.communication_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 2s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/voi-aig-dev-uai001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001][0m
[0m[1mmodule.ai_service.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001][0m
[0m[1mmodule.communication_service.azurerm_communication_service.communication_service: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mazapi_resource.subnet_container_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ConAppEnvironmentSubnet][0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/276acc93-729b-9c60-3859-c63cb268f835][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/6414a717-a4e8-dac1-997c-817a4d9adc98][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ae79b26e-925e-2c19-1537-44231d416c86][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ConAppPrivateEndpointSubnet][0m
[0m[1mmodule.ai_service.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Network/privateEndpoints/voi-aig-dev-ai001-account-pe][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Network/privateEndpoints/voi-aig-dev-kv001-vault-pe][0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001][0m
[0m[1mmodule.ai_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001|applicationLogs-0][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.communication_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_communication_service: Reading...[0m[0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazurerm_container_app_environment.container_app_environment: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001][0m
[0m[1mmodule.communication_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_communication_service: Still reading... [00m10s elapsed][0m[0m
[0m[1mmodule.communication_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_communication_service: Read complete after 11s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001][0m
[0m[1mmodule.communication_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_communication_service["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001|applicationLogs-0][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_app_environment: Reading...[0m[0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 4s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001|applicationLogs-0][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_app_environment: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_container_app_environment["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001|applicationLogs-0][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-11-07T08:02:39Z][0m
[0m[1mmodule.ai_service.time_sleep.sleep_connectivity: Refreshing state... [id=2025-11-07T08:02:52Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_container_app.container_app_backend[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_app" "container_app_backend" {
      [32m+[0m[0m container_app_environment_id  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001"
      [32m+[0m[0m custom_domain_verification_id = (sensitive value)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m latest_revision_fqdn          = (known after apply)
      [32m+[0m[0m latest_revision_name          = (known after apply)
      [32m+[0m[0m location                      = (known after apply)
      [32m+[0m[0m name                          = "voi-aig-dev-ca001-backend"
      [32m+[0m[0m outbound_ip_addresses         = (known after apply)
      [32m+[0m[0m resource_group_name           = "voi-aig-dev-rg"
      [32m+[0m[0m revision_mode                 = "Single"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "voice-agent"
        }
      [32m+[0m[0m workload_profile_name         = "Consumption"

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = [
              [32m+[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/voi-aig-dev-uai001",
            ]
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "UserAssigned"
        }

      [32m+[0m[0m ingress {
          [32m+[0m[0m allow_insecure_connections = false
          [32m+[0m[0m client_certificate_mode    = "accept"
          [32m+[0m[0m custom_domain              = (known after apply)
          [32m+[0m[0m external_enabled           = true
          [32m+[0m[0m fqdn                       = (known after apply)
          [32m+[0m[0m target_port                = 80
          [32m+[0m[0m transport                  = "auto"

          [32m+[0m[0m traffic_weight {
              [32m+[0m[0m latest_revision = true
              [32m+[0m[0m percentage      = 100
            }
        }

      [32m+[0m[0m secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      [32m+[0m[0m secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      [32m+[0m[0m secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      [32m+[0m[0m template {
          [32m+[0m[0m max_replicas                     = 10
          [32m+[0m[0m min_replicas                     = 1
          [32m+[0m[0m revision_suffix                  = "real-time-backend"
          [32m+[0m[0m termination_grace_period_seconds = 10

          [32m+[0m[0m container {
              [32m+[0m[0m cpu               = 0.5
              [32m+[0m[0m ephemeral_storage = (known after apply)
              [32m+[0m[0m image             = (sensitive value)
              [32m+[0m[0m memory            = "1.0Gi"
              [32m+[0m[0m name              = "real-time-backend"

              [32m+[0m[0m env {
                  [32m+[0m[0m name        = "ACS_CONNECTION_STRING"
                  [32m+[0m[0m secret_name = "acs-connection-string"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name        = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  [32m+[0m[0m secret_name = "ai-connection-string"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "AZURE_OPENAI_ENDPOINT"
                  [32m+[0m[0m value = "https://voi-aig-dev-ai001.openai.azure.com/"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name        = "AZURE_OPENAI_API_KEY"
                  [32m+[0m[0m secret_name = "aoai-primary-access-key"
                }
            }

          [32m+[0m[0m http_scale_rule {
              [32m+[0m[0m concurrent_requests = "50"
              [32m+[0m[0m name                = "http-scale-rule"
            }
        }
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_aoai_primary_access_key[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_aoai_primary_access_key" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001"
      [32m+[0m[0m name                    = "aoai-primary-access-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_application_insights_connection_string[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_application_insights_connection_string" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001"
      [32m+[0m[0m name                    = "ai-connection-string"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_communication_service_primary_connection_string[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_communication_service_primary_connection_string" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001"
      [32m+[0m[0m name                    = "acs-connection-string"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with azurerm_monitor_diagnostic_setting.diagnostic_setting_container_app_environment["0"],
[33m│[0m [0m  on containerapps.tf line 26, in resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_container_app_environment":
[33m│[0m [0m  26: resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_container_app_environment" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0m`metric` has been deprecated in favor of the `enabled_metric` property and
[33m│[0m [0mwill be removed in v5.0 of the AzureRM provider
[33m│[0m [0m
[33m│[0m [0m(and 5 more similar warnings elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>